# MERGE NEDİR ?

Belirtilen yöntem(ler)i kullanarak veri setlerini bir araya getirerek iki DataFrame'in içeriğini günceller.

In [1]:
import pandas as pd
import numpy as np

In [15]:
calisan_1 = {
    "calisan_id":[1,2,3,4],
    "calisan_isim":["Aynur Mavi","Ahmet Yıldırım","Hande Dağbaşı","Zafer Yılmaz"]
}

calisan_2 ={ 
    "giris_id":[1,2,3,4],
    "calisan_isim":["Hasan İnce","Hande Dağbaşı","Ahmet Yıldırım","Yusuf Kaya"]
}

In [16]:
# yukarda oluşturduğumuz sözlükleri ayrı iki d.frame yapalım ardından birleştirelim ...

df_1 = pd.DataFrame(calisan_1)
df_2 = pd.DataFrame(calisan_2)

In [17]:
df_1

   calisan_id    calisan_isim
0           1      Aynur Mavi
1           2  Ahmet Yıldırım
2           3   Hande Dağbaşı
3           4    Zafer Yılmaz

In [18]:
df_2

   giris_id    calisan_isim
0         1      Hasan İnce
1         2   Hande Dağbaşı
2         3  Ahmet Yıldırım
3         4      Yusuf Kaya

How komutu :
inner atarsak sadece ortak ada sahip verileri işler , 
left atarsak soldaki tabloyu temel alır ve sağdakileri ona göre gösterir , 
right atarsak sağdaki tabloyu temel alır ve soldakileri ona göre gösterir

In [19]:
pd.merge(df_1,df_2, how = "inner")

   calisan_id    calisan_isim  giris_id
0           2  Ahmet Yıldırım         3
1           3   Hande Dağbaşı         2

In [20]:
pd.merge(df_1,df_2, how = "left")

   calisan_id    calisan_isim  giris_id
0           1      Aynur Mavi       NaN
1           2  Ahmet Yıldırım       3.0
2           3   Hande Dağbaşı       2.0
3           4    Zafer Yılmaz       NaN

In [21]:
pd.merge(df_1,df_2, how = "right")

   calisan_id    calisan_isim  giris_id
0         NaN      Hasan İnce         1
1         3.0   Hande Dağbaşı         2
2         2.0  Ahmet Yıldırım         3
3         NaN      Yusuf Kaya         4